## Pandas - manipolazioni 

Creazione dataframe.

Vuoto:

In [2]:
import pandas as pd

t1 = pd.DataFrame()
print(t1)

Empty DataFrame
Columns: []
Index: []

In [3]:
#da una lista e quindi con una sola colonna

t2 = pd.DataFrame(['mele', 'pere', 'kiwi'])
t2

      0
0  mele
1  pere
2  kiwi

In [5]:
#da una lista di liste
t3 = pd.DataFrame(data=[['mele', 12, 1.02],['pere', 100, 0.97],['kiwi', 55, 2.40]])
t3

      0    1     2
0  mele   12  1.02
1  pere  100  0.97
2  kiwi   55  2.40

In [10]:
#con delle series che devono avere le chiavi in comune!

fruit = pd.Series(index=[123,234,456], data=['mele', 'pere', 'kiwi'])
mag = pd.Series(index=[123,234,456], data=[100,56,75])
shop = pd.DataFrame({'frutta':fruit, 'qta':mag})
shop

    frutta  qta
123   mele  100
234   pere   56
456   kiwi   75

In [11]:
fruit = pd.Series(index=[123,234,456,789], data=['mele', 'pere', 'kiwi', 'fragola'])
mag = pd.Series(index=[123,234,456,999], data=[100,56,75,1000])
shop = pd.DataFrame({'frutta':fruit, 'qta':mag})
shop

      frutta     qta
123     mele   100.0
234     pere    56.0
456     kiwi    75.0
789  fragola     NaN
999      NaN  1000.0

## manipolazione e accesso ai dati

Accedo per numero di riga

In [14]:
shop.iloc[4]

frutta       NaN
qta       1000.0
Name: 999, dtype: object

accedo per chiave

In [15]:
shop.loc[123]

frutta     mele
qta       100.0
Name: 123, dtype: object

modifico una riga per chiave

In [19]:
shop.loc[999] = ['noci', 1001]
shop

      frutta     qta
123     mele   100.0
234     pere    56.0
456     kiwi    75.0
789  fragola     NaN
999     noci  1001.0

modifico per posizione della riga

In [20]:
shop.iloc[3] = ['fragole', 99]
shop

      frutta     qta
123     mele   100.0
234     pere    56.0
456     kiwi    75.0
789  fragole    99.0
999     noci  1001.0

se uso un indice che non esiste... creo una nuova riga

In [21]:
shop.loc[888] = ['pomodori', 222]
shop

       frutta     qta
123      mele   100.0
234      pere    56.0
456      kiwi    75.0
789   fragole    99.0
999      noci  1001.0
888  pomodori   222.0

per eliminare una riga uso drop

In [22]:
shop2 = shop.drop(999)
shop2

       frutta    qta
123      mele  100.0
234      pere   56.0
456      kiwi   75.0
789   fragole   99.0
888  pomodori  222.0

per cancellare una colonna

In [23]:
shop3 = shop.drop('qta', axis=1)
shop3

       frutta
123      mele
234      pere
456      kiwi
789   fragole
999      noci
888  pomodori

per cancellare una riga per posizione

Devo ottenere l'etichetta/key con index

In [24]:
shop.index

Index([123, 234, 456, 789, 999, 888], dtype='int64')

l'ultima riga ha questo indice

In [25]:
shop.index[-1]

np.int64(888)

In [26]:
shop4 = shop.drop(shop.index[-1])
shop4

      frutta     qta
123     mele   100.0
234     pere    56.0
456     kiwi    75.0
789  fragole    99.0
999     noci  1001.0

**concatenare** tabelle

servono 2 tabelle

In [27]:
shop

       frutta     qta
123      mele   100.0
234      pere    56.0
456      kiwi    75.0
789   fragole    99.0
999      noci  1001.0
888  pomodori   222.0

In [28]:
ff = pd.Series(index=[100,101,102], data=['patate', 'sedano', 'insalata'])
mm = pd.Series(index=[100,101,102], data=[44,55,66])
orto = pd.DataFrame({'frutta':ff, 'qta':mm})
orto

       frutta  qta
100    patate   44
101    sedano   55
102  insalata   66

In [32]:
globale=pd.concat([shop, orto])
globale

       frutta     qta
123      mele   100.0
234      pere    56.0
456      kiwi    75.0
789   fragole    99.0
999      noci  1001.0
888  pomodori   222.0
100    patate    44.0
101    sedano    55.0
102  insalata    66.0

resetto gli indici e li rigenero

In [33]:
globale2=pd.concat([shop, orto]).reset_index(drop=True)
globale2

     frutta     qta
0      mele   100.0
1      pere    56.0
2      kiwi    75.0
3   fragole    99.0
4      noci  1001.0
5  pomodori   222.0
6    patate    44.0
7    sedano    55.0
8  insalata    66.0

E' possibile **iterare** con cicli for su indice o posizione

In [42]:
for i in shop.index:
    #print(i)
    el = shop.loc[i]
    #print(el)
    print(el['frutta'])

mele
pere
kiwi
fragole
noci
pomodori

è possibile usare **iterrow** di pandas - iterazione su *righe*

In [43]:
for indice, valori in shop.iterrows():
    print(indice, valori.frutta, valori.qta)

123 mele 100.0
234 pere 56.0
456 kiwi 75.0
789 fragole 99.0
999 noci 1001.0
888 pomodori 222.0

 Il metodo **.items()** in pandas viene usato per iterare su ciascuna **colonna** di un DataFrame, restituendo la coppia di nome della colonna e il suo contenuto (come una Serie). Questo è utile quando vuoi esplorare o manipolare le colonne individualmente.

In [48]:
# Creiamo un DataFrame di esempio
data = {'Nome': ['Alice', 'Bob', 'Charlie'],
        'Età': [25, 30, 35],
        'Città': ['Roma', 'Milano', 'Napoli']}

df = pd.DataFrame(data)

# Iteriamo sulle colonne del DataFrame usando items()
for colonna, contenuto in df.items():
    print(f"Colonna: {colonna}")
    print(contenuto)
    print()

Colonna: Nome
0      Alice
1        Bob
2    Charlie
Name: Nome, dtype: object

Colonna: Età
0    25
1    30
2    35
Name: Età, dtype: int64

Colonna: Città
0      Roma
1    Milano
2    Napoli
Name: Città, dtype: object